CONFIGURE SERIAL INTERFACE (PPP) (WITH CHAP)

R1# configure-terminal
R1(config)# hostname <name>
! set username <name> to match neighbor router hostname
R1(config)# username <name> password <password>
R1(config)# interface serial <number>
R1(config-if)# ip address <address> <mask>
R1(config-if)# encapsulation ppp
R1(config-if)# ppp authentication chap
R1(config-if)# no shutdown
! verify device has DCE cable, if so apply clock rate
R1(config-if)# show controllers serial <number>
R1(config-if)# clock rate <speed-in-bps>
! set appropriate interface bandwidth
R1(config-if)# bandwidth <speed-in-kpbs>
R1(config-if)# description <description>
R1(config-if)# end
R1# wr

--------------------------------------------------------------------------------


<ol>
<li>Define the usernames and passwords used by the two routers:
<ol style="list-style-type: upper-alpha; padding-bottom: 0;">
<li style="margin-left:1em">Use the hostname name command in global configuration mode on each router, to set the local router’s name to use when authenticating.</li><br>
<li style="margin-left:1em">Use the username name password password command in global configuration mode on each router, to define the name (case-sensitive) used by the neighboring router, and the matching password (case-sensitive). (The name in the username command should match the name in the neighboring router’s hostname command.)</li><br>
</ol>
</li>
<li>Configure the serial interface for PPP, CHAP, and other necessary settings:
<ol style="list-style-type: upper-alpha; padding-bottom: 0;">
<li style="margin-left:1em">Use the ip address address mask command in serial interface configuration mode to configure the interface IP address.</li><br>
<li style="margin-left:1em; padding-bottom: 0;">Use the encapsulation ppp command in interface configuration mode, on the serial interfaces on both routers, to enable PPP on the interfaces.</li><br>
<li style="margin-left:1em; padding-bottom: 0;">Use the ppp authentication chap command in interface configuration mode on each router to enable CHAP on each interface.</li><br>
<li style="margin-left:1em; padding-bottom: 0;">If the interface line status is administratively down, use the no shutdown command in interface configuration mode to enable the interface.</li><br>
<li style="margin-left:1em; padding-bottom: 0;">If the serial link is a back-to-back serial link in a lab (or a simulator), use the clock rate speed command in interface configuration mode to configure the clocking rate. Use this command only on the one router with the DCE cable (per the show controllers serial number command).</li><br>
<li>The following steps are always optional and have no impact on whether the link works and passes IP traffic:
<ol style="list-style-type: upper-alpha; padding-bottom: 0;">
<li style="margin-left:1em">Use the bandwidth speed-in-kbps command in interface configuration mode to configure the link’s documented speed so that it matches the actual clock rate of the link.</li><br>
<li style="margin-left:1em; padding-bottom: 0;">For documentation purposes, use the description text command in interface configuration mode to configure a description of the purpose of the interface.</li>
</ol>
</li>
</ol>